---
kind: property
id: P:Autodesk.Revit.UI.FileOpenDialog.ShowPreview
source: html/09ecf97f-9be7-17e7-8e7d-194ba6079bff.htm
---
# Autodesk.Revit.UI.FileOpenDialog.ShowPreview Property

Identifies if the dialog should include a region showing a preview of the selected file.

## Syntax (C#)
```csharp
public bool ShowPreview { get; set; }
```